{
    "about": {
        "team": "Project team",
        "netidee": {
            "top": "Images2Mesh Web",
            "sub": "funded by Netidee"
        },
        "content": "A key step in any scanning-based asset creation workflow is to convert unordered point clouds to a surface. Classical methods (e.g., Poisson reconstruction) start to degrade in the presence of noisy and partial scans. Hence, deep learning based methods have recently been proposed to produce complete surfaces, even from partial scans. However, such data-driven methods struggle to generalize to new shapes with large geometric and topological variations. We present Points2Surf, a novel patch-based learning framework that produces accurate surfaces directly from raw scans without normals. Learning a prior over a combination of detailed local patches and coarse global information improves generalization performance and reconstruction accuracy.\n \n Our extensive comparison on both synthetic and real data demonstrates a clear advantage of our method over state-of-the-art alternatives on previously unseen classes (on average, Points2Surf brings down reconstruction error by 30% over SPR and by 270%+ over deep learning based SotA methods) at the cost of longer computation times and a slight increase in small-scale topological noise in some cases. Our source code, pre-trained model, and dataset are available on:",
        "stefan": "Project lead",
        "philipp": "Project lead",
        "sophie": "Frontend"
    },
    "menu": {
        "download": "download",
        "edit": "edit"
    },
    "edit": {
        "interaction": "Upload a file from the server by entering the matching ID or load a .ply or .obj file to view and edit via drag&drop or the upload-button. \n \nShortcuts:\nq   Translate\nr   Rotate\ns   Scale\n+   Increase light intesity\n-   Decrease light intesity",
        "conversion": "CONVERSION",
        "reconstruct": "Reconstruct Mesh",
        "transformation": "TRANSFORMATIONS",
        "scale": "Scale",
        "activate": "Activate",
        "crop": {
            "crop": "CROP",
            "keep": "Keep intersections",
            "remove": "Remove intersections"
        },
        "measure": "MEASUREMENT",
        "warning": {
            "progress_1": "The file with ID ",
            "progress_2": " is getting generated.\nPlease try again later by pressing the refresh button",
            "notfound": "No file found with the ID ",
            "error": "An error occured while loading the file with ID "
        }
    },
    "upload": {
        "email": "\n[Optional] Notification email when convertion is done",
        "pc": {
            "hint": "Check the above box to increase processing time and quality. The images are converted to a point cloud instead of directly generating the reconstructed model. The point cloud can be edited and cleaned up in the Edit area and can then be uploaded again under Ply-2-Mesh to generate the final reconstructed model.",
            "label": "Convert to PointCloud"
        },
        "files": {
            "drop": "Drop files here to upload",
            "support": "Supports "
        },
        "submit": "Submit files"
    }
}