{
    "about": {
        "team": "Projektteam",
        "netidee": {
            "top": "Pics2Model Web (Beta Version)",
            "sub": "gefördert von Netidee"
        },
        "content": "<bold>Was ist Pics2Model?</bold>\nPics2Model ist ein kostenloser Webservice, mit dem ihr einige Bilder in ein 3D-Modell umwandeln könnt. Ihr müsst dazu nichts installieren, nur eure Bilder hochladen und unser Server übernimmt den Rest. Mit unserem Online-Editor könnt ihr das Modell rotieren, bewegen, skalieren und zuschneiden. Schließlich könnt ihr das erzeugte Modell herunterladen und bei Bedarf mit einem Modeling-Tool eurer Wahl verfeinern.\n\n<bold>Für wen ist Pics2Model?</bold>\nPics2Model ist gedacht für alle, die schnell und einfach ein 3D-Modell aus Bildern generieren wollen. Hier einige Beispiele: Künstler*innen können z.B. digitale Kopien ihrer Skulpturen auf einer Website anzeigen. So können ganze Online-Kataloge for Museen und Läden entstehen. Vermieter*innen können mit Pics2Model virtuelle Besichtigungen anbieten. Ihr könnte das Modell für 3D-Druck verwenden (etwas Nachbearbeitung wird nötig sein). Stadtplaner*innen können mit dem Modell mögliche Änderungen kommunizieren. Unsere 3D-Modelle können auch die Basis für Meshes für Spiele sein.\n\nWie kann man gute Ergebnisse bekommen?</bold>\nIhr werdet überraschend viele Fotos benötigen, abhängig von der Größe und Komplexität des Zielobjekts. Als grobe Richtlinie, ihr braucht 50+ Bilder für einzelne Objekte und 100+ für einen Raum. Die Fotos sollten mindestens zu 50% überlappen und das Objekt aus allen Richtungen zeigen. Wenn möglich, verwendet die gleiche Kamera und sorgt für ähnliche Lichtverhältnisse. Vermeidet Objekte mit sehr gleichmäßiger Oberfläche, mit stark glänzendem oder transparentem Material. \n\n<bold>Wie funktioniert Pics2Model?</bold>\nDie Verarbeitungsschritte sind:\nBilder >> Structure from Motion (SfM) >> Multi-View Stereo (MVS) >> Rekonstruktion >> 3D Modell\nUnser Webservice verwendet SfM und MVS von <a href='https://colmap.github.io/'>COLMAP</a> und Screened Poisson Surface Reconstruction von <a href='https://www.meshlab.net/'>Meshlab</a>, um die bestmögliche Qualität mit minimalen Einschränkungen zu ermöglichen. Ihr habt auch direkten Zugriff auf die Punktwolke, ein Zwischenergebnis zwischen MVS und Rekonstruktion.\n\n<bold>Welche Einschränkungen gibt es?</bold>\nDie Ressourcen des Servers sind limitiert. Damit es fair bleibt müssen wir die Rechenzeit für jedes Objekt begrenzen. Das tun wir, indem wir die Anzahl der Bilder und deren Gesamtgröße limitieren. Wenn ihr diese Begrenzung für besonders große Objekte oder besonders genaue Modelle überschreiten müsst, kontaktiert uns bitte. Wir können wahrscheinlich eine Lösung finden.\n\n<bold>Warum ist Pics2Model kostenlos?</bold>\nVielen Dank and <a href='https://www.netidee.at/images2mesh-web'>Netidee</a> für die Förderung dieses Projekts! Netidee ist ein Förderprogramm der <a href='https://www.internetstiftung.at/'>Internet Stiftung Österreich</a>, die damit das freie Internet unterstützt. Dieses Projekt wird an der TU WIEN, hauptsächlich bei der <a href='https://www.cg.tuwien.ac.at/'>Forschungsgruppe für Computergraphik</a> von Angestellten und Studierenden durchgeführt.",
        "stefan": "Planung",
        "philipp": "Projekt Organisierung und Planung",
        "sophie": "Frontend",
        "johannes": "SfM und MVS",
        "maximilian": "Backend",
        "florian": "Rekonstruction"
    },
    "menu": {
        "download": "Herunterladen",
        "edit": "Bearbeiten",
        "about": "Projekt"
    },
    "edit": {
        "interaction": "Lade entweder ein Modell vom Server durch das Eingeben der entsprechenden ID oder lade .ply oder .obj Dateien via drag&drop oder über die Schaltfläche rechts unten. \n \nShortcuts:\nt   Translation\nr   Rotation\ns   Skalierung\n+   Lichtintensität erhöhen\n-   Lichtintensität reduzieren",
        "interaction_no_lights": "Lade entweder ein Modell vom Server durch das Eingeben der entsprechenden ID oder lade .ply oder .obj Dateien via drag&drop oder über die Schaltfläche rechts unten. \n \nShortcuts:\nt   Translation\nr   Rotation\ns   Skalierung",
        "conversion": "KONVERTIERUNG",
        "reconstruct": "Mesh Rekonstruktion",
        "transformation": "TRANSFORMATIONEN",
        "activate": "Aktivieren",
        "scale": "Skalierung",
        "crop": {
            "crop": "SCHNEIDEN",
            "keep": "Behalte Überschn.",
            "remove": "Entferne Überschn."
        },
        "measure": "MAßE",
        "warning": {
            "progress_1": "Die Datei mit der ID ",
            "progress_2": " wird momentan erstellt.\nBitte versuchen Sie es später noch einmal",
            "notfound": "Keine Datei wurde gefunden mit der ID ",
            "error": "Ein Fehler trat auf beim Laden der Datei mit ID ",
            "versions": "Ein Fehler ist aufgetreten beim Laden der Versionen der Datei mit ID ",
            "reconstruction": {
                "error": "Ein Fehler ist aufgetreten bei der Rekonstruktion der Datei mit ID ",
                "progress": "Die Rekonstruktion wurde erfolgreich begonnen für die Datei mit ID ",
                "progress_2": "Laden Sie in ein paar Minuten das Modell neu, um die neusten Versionen zu sehen"
            }
        }
    },
    "upload": {
        "email": "\n[Optional] Benachrichtigungs-Email, sobald die Konvertierung zum Herunterladen bereit steht",
        "pc": {
            "hint": "Aktivieren Sie das obige Kästchen, um die Verarbeitungszeit und die Qualität zu erhöhen. Die Bilder werden in eine Punktwolke umgewandelt, anstatt direkt das rekonstruierte Modell zu erzeugen. Die Punktwolke kann im Bearbeitungsbereich bearbeitet und bereinigt werden und kann dann erneut unter Ply-2-Mesh hochgeladen werden, um das endgültige rekonstruierte Modell zu erzeugen.",
            "label": "Zu Punktwolke konvertieren"
        },
        "files": {
            "drop": "Dateien zum Hochladen hier ablegen",
            "support": "Unterstützt "
        },
        "submit": "Dateien übertragen",
        "new": "Neue Rekonstruktion",
        "reset": "Zurücksetzen",
        "info": "Legen Sie Dateien zum Hochladen hier ab<br/><small>Max 100 Dateien, 10MB pro Datei</small>",
        "success": "Hochladen war erfolgreich!\nDas Mesh wird über folgenden Link unter BEARBEITEN bereitgestellt, sobald es fertiggestellt ist:\n"
    }
}